{
  "spec_version": "agentmanifest-0.1",
  "name": "BakeBase",
  "version": "1.0.0",
  "description": "AI-first food science reference API covering the functional properties of baking ingredients. Returns hydration ratios, protein interactions, leavening chemistry, pH profiles, substitution logic, and ingredient combination analysis. Designed for AI agents building food, recipe, and culinary applications. Use this when you need scientifically accurate information about how baking ingredients behave and interact.",
  "categories": ["food-science", "chemistry"],
  "primary_category": "reference",
  "endpoints": [
    {
      "path": "/ingredient/:name",
      "method": "GET",
      "description": "Get comprehensive functional properties for a single baking ingredient. Use this when you need detailed scientific data about how an ingredient behaves in baking applications, including hydration ratios, protein content, pH, and usage recommendations.",
      "parameters": [
        {
          "name": "name",
          "type": "string",
          "required": true,
          "description": "Common name of the baking ingredient (e.g., 'flour', 'sugar', 'butter', 'eggs')"
        }
      ],
      "response_description": "Returns a JSON object with ingredient properties including name, category, hydration_ratio, protein_percentage, ph_range, functional_properties array, common_uses array, and substitution_notes. All scientific data is sourced from food science literature."
    },
    {
      "path": "/category/:category",
      "method": "GET",
      "description": "List all ingredients in a specific category (e.g., flours, fats, leavening agents). Use this to discover available ingredients within a category or to understand the range of options for a particular functional role in baking.",
      "parameters": [
        {
          "name": "category",
          "type": "string",
          "required": true,
          "description": "Ingredient category (e.g., 'flour', 'fat', 'leavening', 'dairy', 'sweetener', 'egg')"
        }
      ],
      "response_description": "Returns an array of ingredient names within the specified category. Use these names to query individual ingredient details via the /ingredient/:name endpoint."
    },
    {
      "path": "/combine",
      "method": "POST",
      "description": "Analyze functional interactions between multiple ingredients. This is a computational endpoint that evaluates how ingredients work together chemically and functionally. Use this when you need to understand ingredient compatibility, potential reactions, or optimize ingredient combinations for specific baking goals.",
      "parameters": [
        {
          "name": "ingredients",
          "type": "array",
          "required": true,
          "description": "Array of ingredient names to analyze for interactions"
        }
      ],
      "response_description": "Returns analysis of ingredient interactions including compatibility_score, potential_reactions array, recommended_ratios, and notes on how the ingredients work together functionally. Provides scientific reasoning for the analysis."
    },
    {
      "path": "/search",
      "method": "GET",
      "description": "Search ingredients by properties or characteristics. Use this when you need to find ingredients matching specific functional criteria (e.g., 'high protein', 'acidic', 'fat content').",
      "parameters": [
        {
          "name": "q",
          "type": "string",
          "required": true,
          "description": "Search query for ingredient properties or characteristics"
        }
      ],
      "response_description": "Returns array of ingredients matching the search criteria, each with basic properties. Use ingredient names to fetch full details via /ingredient/:name."
    }
  ],
  "pricing": {
    "model": "free",
    "free_tier": {
      "queries_per_day": 10000,
      "queries_per_month": null
    },
    "paid_tier": null,
    "support_url": "https://github.com/AMProtocol/BakeBase"
  },
  "authentication": {
    "required": false,
    "type": null,
    "instructions": null
  },
  "reliability": {
    "maintained_by": "individual",
    "status_url": null,
    "expected_uptime_pct": 99.0
  },
  "agent_notes": "BakeBase is optimized for AI agents building food and recipe applications. When using the /combine endpoint, provide 2-5 ingredients for best results - the analysis considers chemical reactions, functional interactions, and recommended usage ratios. All hydration ratios assume room temperature water unless otherwise specified. pH ranges are typical values and can vary by brand or processing method. For substitution recommendations, always consider the functional role of the ingredient in the specific recipe context. The data focuses on functional properties rather than nutritional information. Use category endpoints to discover available ingredients before querying specific items.",
  "contact": "https://github.com/AMProtocol/BakeBase",
  "listing_requested": true,
  "last_updated": "2025-02-15T10:00:00Z"
}
